Revit 2026 API

# EnergyAnalysisSpaceComposedName Property

---

The composed name for this space.

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string ComposedName { get; }
```
```vb
Public ReadOnly Property ComposedName As String
	Get
```
```cpp
public:
property String^ ComposedName {
	String^ get ();
}
```
```fsharp
member ComposedName : string with get
```

#### Property Value

String

This value is composed of the number and name attributes, separated by a space.

#### Reference

EnergyAnalysisSpace Class

Autodesk.Revit.DB.Analysis Namespace